//*****************************************************************************
//
//                  版权所有 (C), 1998-2011, 华为技术有限公司
//
//*****************************************************************************
//  文 件 名   : hi_cmn_nv.h
//  版 本 号   : V1.0 
//  作    者   : shenhankun/00130424
//  生成日期   : 2011-10-26
//  功能描述   : COMMON的NV项设置 
//               
//  函数列表   : TODO: ...
//  修改历史   : 
//  1.日    期 : 2011-10-26
//    作    者 : shenhankun/00130424
//    修改内容 : 创建文件 
//
//*****************************************************************************

//*****************************************************************************
// PROJECT   : 
// SUBSYSTEM :
// MODULE    :  
// OWNER     :  
//*****************************************************************************


#ifndef __HI_CMN_NV_H__
#define __HI_CMN_NV_H__


//*****************************************************************************
// NV ID 定义 [0x0120-0x0150)
//*****************************************************************************
#define  HI_NV_CMN_CFG_ID   0x0120 // HI_NV_CMN_CFG_ID_S 
#define NDM_DC_FOLDER_NAME_SIZE 21 
//*****************************************************************************


//*****************************************************************************
// NV项数据结构定义
//*****************************************************************************
typedef struct
{
    HI_U32  ramSize;          //盲采开始地址
    HI_S32  AgcGain; 		    //增益对盲采有效 
    HI_U16  usTrigerType;       //采数类型
    HI_U16  periodTime;         //盲采周期，单位分钟
    HI_U16  trigerTime;         //多长时间收不到PB快进行触发采数，单位分钟
    HI_U16  nameId;		        //每次按键启动采数 +1

    HI_U8   TimesPerPeriod;     //盲采每个周期连续进行多少次采集。
    HI_U8   ucCPowerOnEable;// 重启续采功能使能开关
    HI_U8   ucCollecting;// 是否正在进行采数
    HI_U8   isFollowMode;
}HI_NDM_DATA_COLLECT_NV_S;

typedef struct 
{ 
    HI_U8 ucTargetIp[4];//3518侧IP地址
}HI_NV_CMN_CFG_ID_S;

//*****************************************************************************



//*****************************************************************************
#endif //__HI_CMN_NV_H__


