//*****************************************************************************
//
//                  版权所有 (C), 1998-2012, 华为技术有限公司
//
//*****************************************************************************
//  文 件 名   : mrs_dfx_init.c
//  版 本 号   : V1.0
//  作    者   : shenhankun/00130424
//  生成日期   : 2012-01-20
//  功能描述   : MRS 的DFX功能初始化
//
//  函数列表   : TODO: ...
//  修改历史   :
//  1.日    期 : 2012-01-20
//    作    者 : shenhankun/00130424
//    修改内容 : 创建文件
//
//*****************************************************************************

//*****************************************************************************
// PROJECT   :
// SUBSYSTEM :
// MODULE    :
// OWNER     :
//*****************************************************************************

#include "mrs_common.h"
#include "mrs_dfx.h"
#include "mrs_dfx_cco_remote_upg.h"


HI_U32 mrsDfxInit(HI_VOID)
{
    HI_U32 ret = HI_ERR_SUCCESS;

    mrsDfxStatInit();

#if defined(PRODUCT_CFG_PRODUCT_TYPE_CCO)
    mrsDfxRemoteUpgInit();
#endif

    return ret;
}


