//*****************************************************************************
//
//                  版权所有 (C), 1998-2011, 华为技术有限公司
//
//*****************************************************************************
//  文 件 名   : mrs_fw_cmd.h
//  版 本 号   : V1.0 
//  作    者   : fengxiaomin/f00209182
//  生成日期   : 2014-7-17
//  功能描述   : 命令注册相关处理函数及接口定义
//               
//  函数列表   : TODO: ...
//  修改历史   : 
//  1.日    期 : 2014-7-17
//    作    者 : fengxiaomin/f00209182 
//    修改内容 : 创建文件 
//
//*****************************************************************************
#ifndef __MRS_FW_CMD_H__
#define __MRS_FW_CMD_H__
HI_START_HEADER

HI_VOID mrsRegistCommandInit(HI_VOID);



HI_END_HEADER
#endif