//*****************************************************************************
//
//                  版权所有 (C), 2001-2014, 华为技术有限公司
//
//*****************************************************************************
//  文 件 名   : mrs_srv_cco_archives.h
//  版 本 号   : V1.0 
//  作    者   : cuiate/c00233580
//  生成日期   : 2014-10-30
//  功能描述   : 该模块提供表档案管理的功能接口定义，主要实现以下功能：
//               1)  表档案存储管理
//               2)  表档案相关操作函数，包括增删表项等
//  函数列表   : 
//  修改历史   : 
//  1.日    期 : 2014-10-30
//    作    者 : cuiate/c00233580
//    修改内容 : 创建文件 
//
//*****************************************************************************

#ifndef _MRS_SRV_ARCHIVES_H_
#define _MRS_SRV_ARCHIVES_H_
HI_START_HEADER

#include "mrs_srv_cco.h"

#if defined(PRODUCT_CFG_PRODUCT_TYPE_CCO)
//*****************************************************************************
//*****************************************************************************



//*****************************************************************************
// 函数名称: mrsSrvArchivesInit
// 功能描述: 表档案模块初始化
// 参数说明: 无
// 返 回 值: 
//   成功: HI_ERR_SUCCESS
//   失败: 其它值
// 作    者: cuiate/c00233580 [2014-10-30]
//*****************************************************************************
HI_PUBLIC HI_U32 mrsSrvArchivesInit(HI_VOID);

//*****************************************************************************
// 函数名称: mrsSrvArchivesLoad
// 功能描述: 从FLASH中读取表档案
// 参数说明: 无
// 返 回 值: 
//   成功: HI_ERR_SUCCESS
//   失败: HI_ERR_FAILURE
// 作    者: cuiate/c00233580 [2014-10-30]
//*****************************************************************************
HI_PUBLIC HI_U32 mrsSrvArchivesLoad(HI_VOID);

//*****************************************************************************
// 函数名称: mrsSrvArchivesSave
// 功能描述: 存储表档案到FLASH
// 参数说明: 无
// 返 回 值: 
//   成功: HI_ERR_SUCCESS
//   失败: HI_ERR_MALLOC_FAILUE
// 作    者: cuiate/c00233580 [2014-10-30]
//*****************************************************************************
HI_PUBLIC HI_U32 mrsSrvArchivesSave(HI_VOID);

//*****************************************************************************
// 函数名称: mrsSrvArchivesInsert
// 功能描述: 添加节点(电表)信息到表档案列表末尾
// 参数说明: 
//   pstNode       [IN] 节点(电表)信息
//   bRepeatCheck  [IN] 重复检查标识
//
// 返 回 值: 
//   成功: HI_ERR_SUCCESS
//   失败: HI_ERR_FAILURE
//
// 作    者: cuiate/c00233580 [2014-11-11]
//*****************************************************************************
HI_PUBLIC HI_U32 mrsSrvArchivesInsert(MRS_ARCHIVES_NODE_STRU *pstNode, HI_BOOL bRepeatCheck);

//*****************************************************************************
// 函数名称: mrsSrvArchivesDelete
// 功能描述: 从表档案列表中删除节点(电表)信息
// 参数说明: 
//   pMeterAddr    [IN] 节点(电表)地址
//
// 返 回 值: 
//   成功: HI_ERR_SUCCESS
//   失败: HI_ERR_FAILURE
//
// 作    者: cuiate/c00233580 [2014-11-11]
//*****************************************************************************
HI_PUBLIC HI_U32 mrsSrvArchivesDelete(HI_PBYTE pMeterAddr);

//*****************************************************************************
// 函数名称: mrsSrvArchivesClear
// 功能描述: 清空表档案列表
// 参数说明: 无
// 返 回 值: 
//   成功: HI_ERR_SUCCESS
//   失败: HI_ERR_FAILURE
// 作    者: cuiate/c00233580 [2014-10-31]
//*****************************************************************************
HI_PUBLIC HI_U32 mrsSrvArchivesClear(HI_VOID);

//*****************************************************************************
// 函数名称: mrsSrvArchivesRealign
// 功能描述: 表档案列表重新排列，用后面的节点(电表)信息补齐空位
// 参数说明: 无
// 返 回 值: 
//   成功: HI_ERR_SUCCESS
//   失败: HI_ERR_FAILURE
// 作    者: cuiate/c00233580 [2014-11-11]
//*****************************************************************************
HI_PUBLIC HI_U32 mrsSrvArchivesRealign(HI_VOID);

//*****************************************************************************
// 函数名称: mrsSrvArchivesQuery
// 功能描述: 根据索引号查询节点(电表)信息
// 参数说明: 
//   usIndex       [IN]  节点(电表)索引号
//
// 返 回 值: 
//   成功: 节点(电表)信息指针
//   失败: HI_NULL
// 作    者: cuiate/c00233580 [2014-11-11]
//*****************************************************************************
HI_PUBLIC MRS_ARCHIVES_NODE_STRU *mrsSrvArchivesQuery(HI_U16 usIndex);

//*****************************************************************************
// 函数名称: mrsSrvArchivesMeterNum
// 功能描述: 返回表档案中节点(电表)数量
// 参数说明: 无
// 返 回 值: 
//   节点(电表)数量
// 作    者: cuiate/c00233580 [2014-11-11]
//*****************************************************************************
HI_PUBLIC HI_U16 mrsSrvArchivesMeterNum(HI_VOID);

//*****************************************************************************
// 函数名称: mrsSrvArchivesIsChanged
// 功能描述: 表档案变化标识
// 参数说明: 无
// 返 回 值: 
//   HI_TRUE:  表档案有变化
//   HI_FALSE: 表档案无变化
// 作    者: cuiate/c00233580 [2014-11-11]
//*****************************************************************************
HI_PUBLIC HI_BOOL mrsSrvArchivesIsChanged(HI_VOID);

//*****************************************************************************
// 函数名称: mrsSrvArchivesChangedFlagClear
// 功能描述: 清除表档案变化标识
// 参数说明: 无
// 返 回 值: 无
// 作    者: cuiate/c00233580 [2014-11-11]
//*****************************************************************************
HI_PUBLIC HI_VOID mrsSrvArchivesChangedFlagClear(HI_VOID);

//*****************************************************************************
// 函数名称: mrsSrvArchivesReadFlagClear
// 功能描述: 清除表档案抄读标识
// 参数说明: 无
// 返 回 值: 
//   成功: HI_ERR_SUCCESS
//   失败: HI_ERR_FAILURE
// 作    者: cuiate/c00233580 [2014-11-07]
//*****************************************************************************
HI_PUBLIC HI_U32 mrsSrvArchivesReadFlagClear(HI_VOID);

//*****************************************************************************
// Function: mrsSrvArchiversQueryByAddr
// Description: Query meter information by address.
// Parameter: 
//     pMeterAddr: Meter address
// Return: 
//   Success: Meter node information pointer
//   Failure: HI_NULL
// Author: cuiate/c00233580 [2016-12-09]
//*****************************************************************************
HI_PUBLIC MRS_ARCHIVES_NODE_STRU * mrsSrvArchiversQueryByAddr(HI_PBYTE pMeterAddr);

HI_PUBLIC HI_BOOL mrsSrvArchivesIsExsit(HI_U8 aucMeterAddr[HI_METER_ADDR_LEN]);

//*****************************************************************************
//*****************************************************************************
#endif

HI_END_HEADER
#endif //_MRS_SRV_ARCHIVES_H_
