//*****************************************************************************
//
//                  版权所有 (C), 1998-2011, 华为技术有限公司
//
//*****************************************************************************
//  文 件 名   : mrs_srv_copy_ctrl_device.h
//  版 本 号   : V1.0 
//  作    者   : liuxipeng/KF54842
//  生成日期   : 2012-08-29
//  功能描述   : 抄控器函数及接口定义
//               
//  函数列表   : TODO: ...
//  修改历史   : 
//  1.日    期 : 2012-08-29
//    作    者 : liuxipeng/KF54842
//    修改内容 : 创建文件 
//
//*****************************************************************************

//*****************************************************************************
// PROJECT   : 
// SUBSYSTEM :
// MODULE    :  
// OWNER     :  
//*****************************************************************************

#ifndef __MRS_SRV_CTRL_H__
#define __MRS_SRV_CTRL_H__

HI_START_HEADER

// 抄控器产品形态初始化
HI_VOID mrsCopyCtrlDeviceInit(HI_VOID);
HI_U32 mrsCcdRxTransmitCmd(HI_U16 ulId, HI_PVOID pCmdParam, HI_U16 usCmdParamSize, HI_U32 ulOption);

HI_END_HEADER
#endif //__MRS_SRV_CCO_READMETER_H__


