/**
 ******************************************************************************
 * @file      comlib.h
 * @brief     公用库函数接口定义.
 * @details   本文件定义了一些基于应用调用的公共函数接口.
 * @copyright
 ******************************************************************************
 */

#ifndef _COMLIB_H_
#define _COMLIB_H_

/*-----------------------------------------------------------------------------
 Section: Includes
 ----------------------------------------------------------------------------*/
#include "hi_types.h"
#include "hi_mdm_datacollect.h"
#include "securec.h"

/*-----------------------------------------------------------------------------
 Section: Macro Definitions
 ----------------------------------------------------------------------------*/
/* NONE */

/*-----------------------------------------------------------------------------
 Section: Type Definitions
 ----------------------------------------------------------------------------*/
/* NONE */

/*-----------------------------------------------------------------------------
 Section: Globals
 ----------------------------------------------------------------------------*/
/* NONE */

/*-----------------------------------------------------------------------------
 Section: Function Prototypes
 ----------------------------------------------------------------------------*/
extern void
binvert(void *pin, HI_S32 bytes);

HI_U16 get_crc16(const void* pbuf, HI_U16 usLen, HI_U16 crc);

extern HI_S32
mem_equal(const void * pfbuf, HI_U8 c, HI_S32 len);

extern HI_S32
mem_bit_equal(HI_U8* p, HI_U8 c, HI_S32 len);

HI_S32 collect_data_pack(HI_BUF_S* HiBuf, 
    HI_U16 frm_sn, 
    HI_U8 **frm_buf, 
    HI_U16 *frm_len);

HI_U16 collect_frm_num(HI_U32 bufSize[], HI_U16 *fnum0, HI_U16 *fnum1);

HI_S32 comm_wr(int fd, void *buf, int len);

#endif  /* _COMLIB_H_ */

/*-----------------------------End of comlib.h--------------------------------*/
