/**
 ******************************************************************************
 * @file       memLib.c
 * @details    basic function handle
 * @copyright
 *
 ******************************************************************************
 */
/*-----------------------------------------------------------------------------
 Section: Includes
 ----------------------------------------------------------------------------*/
#include <hi_types.h>
#include <hi_mdm_types.h>
#if defined (PRODUCT_CFG_PRODUCT_TYPE_NDM) && defined(PRODUCT_CFG_SUPPORT_CCT3911)

#include <stdio.h>
#include <stdlib.h>

#include "securec.h"
#include "maths.h"
#include "mbuf.h"
#include "memLib.h"

/*-----------------------------------------------------------------------------
 Section: Type Definitions
 ----------------------------------------------------------------------------*/
typedef struct
{
    mbuf_id_t id;
    char *name;
    HI_U8 *buf;
    HI_U32 size;
    HI_U32 blksize;
    HI_U32 nblks;
} mem_t;

/*-----------------------------------------------------------------------------
 Section: Constant Definitions
 ----------------------------------------------------------------------------*/
/* NONE */

/*-----------------------------------------------------------------------------
 Section: Global Variables
 ----------------------------------------------------------------------------*/
/* NONE */

/*-----------------------------------------------------------------------------
 Section: Local Variables
 ----------------------------------------------------------------------------*/
static HI_U8 mem_256[4 * TEMP_256];           /**< 4块256 */
static HI_U8 mem_1024[1 * TEMP_1024];         /**< 1块1024 */

mem_t mem[] =
{
    {
       .name = "mem_256",
       .buf = mem_256,
       .size = sizeof(mem_256),
       .blksize = TEMP_256,
       .nblks = sizeof(mem_256)/TEMP_256
    },
    
    {
       .name = "mem_1024",
       .buf = mem_1024,
       .size = sizeof(mem_1024),
       .blksize = TEMP_1024,
       .nblks = sizeof(mem_1024)/TEMP_1024
    },
};

/*-----------------------------------------------------------------------------
 Section: Local Function Prototypes
 ----------------------------------------------------------------------------*/
/* NONE */

/*-----------------------------------------------------------------------------
 Section: Global Function Prototypes
 ----------------------------------------------------------------------------*/
/* NONE */

/*-----------------------------------------------------------------------------
 Section: Function Definitions
 ----------------------------------------------------------------------------*/
/**
 ******************************************************************************
 * @brief   内存管理初始化
 ******************************************************************************
 */
void mlib_init(void)
{
    HI_U32 i;
    for (i = 0; i < ARRAY_SIZE(mem); i++)
    {
        mem[i].id = mbuf_create(mem[i].name, mem[i].buf,
            mem[i].blksize, mem[i].nblks);
    }
}

/**
 ******************************************************************************
 * @brief      内存分配
 * @param[in]  HI_U32 len: 要分配的地址长度
 * @retval     NULL: 分配失败；非NULL分配成功
 ******************************************************************************
 */
void *mlib_malloc(HI_U32 len)
{
    HI_U32 i;
    void *m = NULL;

    for (i = 0; i < ARRAY_SIZE(mem); i++)
    {
       if (mem[i].blksize < len)
       {
           continue;
       }

       m = mbuf_malloc(mem[i].id);
       if (m != NULL)
       {
           break;
       }
    }

    if (m)
    {
        (hi_void)memset_s(m, len, 0, len);
    }
    return m;
}

/**
 ******************************************************************************
 * @brief      内存释放.
 * @param[in]  void *mem: 要释放的地址
 ******************************************************************************
 */
void mlib_free(void* m)
{
    if (NULL == m)
    {
        return;
    }

    HI_U32 i;
    for (i = 0; i < ARRAY_SIZE(mem); i++)
    {
        if (((HI_U32)m >= (HI_U32)mem[i].buf)
                && ((HI_U32)m < ((HI_U32)mem[i].buf + mem[i].size)))
        {
            mbuf_free(mem[i].id, m);
            return;
        }
    }
}

/*------------------------------End of memLib.c---------------------------*/
#endif