//*****************************************************************************
//
//                  版权所有 (C), 1998-2011, 华为技术有限公司
//
//*****************************************************************************
//  文 件 名   : app_init.c
//  版 本 号   : V1.0
//  作    者   : shenhankun/00130424
//  生成日期   : 2011-12-24
//  功能描述   : APP
//
//  函数列表   : TODO: ...
//  修改历史   :
//  1.日    期 : 2011-12-24
//    作    者 : shenhankun/00130424
//    修改内容 : 创建文件
//
//*****************************************************************************

//*****************************************************************************
// PROJECT   :
// SUBSYSTEM :
// MODULE    :
// OWNER     :
//*****************************************************************************
#include "app_common.h"
#include "hi_mdm_mac.h"
#define BIT_FIELD_MASK(n) ((1<<n)-1)
//////////////////////////////////////////////////////////////////////////////
// 在 app_res_cfg.h 文件中 增删任务/队列, 调整任务队列的配置(如名称、大小)
//////////////////////////////////////////////////////////////////////////////
HI_VOID mac_protocol_init(HI_VOID)
{
    HI_MDM_LoadSgAndV100Protocol();
    HI_MDM_LedCtrlRegister();    
}

HI_VOID mac_remote_init(HI_VOID)
{
    HI_MDM_EthInit();
    //Add by zhangyanan/00445172  2018/09/29
    HI_MDM_LoadSwitchRegister();
}

HI_VOID APP_Init(HI_VOID)
{
    HI_MDM_InitStdProtocol();
}